In [6]:
import numpy as np
import pandas as pd

In [7]:
#pandas operations
#conditional selection
#access row and col's
#Access rows and col's
#add and delete columns
#concatenation merging and joining dataframes
#handling missing values
#apply()

In [18]:
d={'USN':[100,101,102],
   'NAME':['jerry','tom','ramesh'],
   'MOBILE':[99,98,77],
   'MARKS':[30,35,32]
  }

In [19]:
std=pd.DataFrame(d)

In [20]:
std

   USN    NAME  MOBILE  MARKS
0  100   jerry      99     30
1  101     tom      98     35
2  102  ramesh      77     32

In [32]:
std.tail(2)

   USN    NAME  MOBILE  MARKS
1  101     tom      98     35
2  102  ramesh      77     32

In [33]:
std.head(2)
#head- displaying rows
#display all by default
#parameter passed, display rows as per parameter

   USN   NAME  MOBILE  MARKS
0  100  jerry      99     30
1  101    tom      98     35

In [23]:
std.columns
#list of columns in my df

Index(['USN', 'NAME', 'MOBILE', 'MARKS'], dtype='object')

In [24]:
std.info()
#give all the info about df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   USN     3 non-null      int64
 1   NAME    3 non-null      object
 2   MOBILE  3 non-null      int64
 3   MARKS   3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

In [25]:
std.isnull()

     USN   NAME  MOBILE  MARKS
0  False  False   False  False
1  False  False   False  False
2  False  False   False  False

In [ ]:
std

In [27]:
#access columns
std['USN']

0    100
1    101
2    102
Name: USN, dtype: int64

In [29]:
#access multiple columns
std[['USN','MARKS']]

   USN  MARKS
0  100     30
1  101     35
2  102     32

In [35]:
std

   USN    NAME  MOBILE  MARKS
0  100   jerry      99     30
1  101     tom      98     35
2  102  ramesh      77     32

In [37]:
#access rows
std.loc[1]
#return row

USN       101
NAME      tom
MOBILE     98
MARKS      35
Name: 1, dtype: object

In [38]:
#access rows
std.loc[2]
#return row

USN          102
NAME      ramesh
MOBILE        77
MARKS         32
Name: 2, dtype: object

In [39]:
#create a dataFrame of cars having a attributes car id,car name

In [46]:
d={'CAR ID':[10,20,30,40,50],
   'CAR NAME':['bmw','rr','volvo','thar','ford']
  }

In [47]:
std=pd.DataFrame(d)

In [48]:
std

   CAR ID CAR NAME
0      10      bmw
1      20       rr
2      30    volvo
3      40     thar
4      50     ford

In [49]:
std.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   CAR ID    5 non-null      int64
 1   CAR NAME  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [62]:
v={'CAR ID':[10,20,30,40,50,60],
   'CAR NAME':['bmw','rr','volvo','thar','ford',None]
  }

In [63]:
df=pd.DataFrame(v)

In [64]:
df

   CAR ID CAR NAME
0      10      bmw
1      20       rr
2      30    volvo
3      40     thar
4      50     ford
5      60     None

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   CAR ID    6 non-null      int64
 1   CAR NAME  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 224.0+ bytes

In [66]:
df.isnull()

   CAR ID  CAR NAME
0   False     False
1   False     False
2   False     False
3   False     False
4   False     False
5   False      True

In [67]:
df.loc[1]

CAR ID      20
CAR NAME    rr
Name: 1, dtype: object

In [68]:
df.iloc[2]

CAR ID         30
CAR NAME    volvo
Name: 2, dtype: object

In [73]:
index=['a','b','c','d','e','f']
df.set_index('CAR NAME')

          CAR ID
CAR NAME
bmw           10
rr            20
volvo         30
thar          40
ford          50
None          60

In [80]:
df.loc[1]

CAR ID      20
CAR NAME    rr
Name: 1, dtype: object

In [76]:
df.iloc[1]

CAR ID      20
CAR NAME    rr
Name: 1, dtype: object

In [69]:
#conditional selection
df['CAR ID']<40

0     True
1     True
2     True
3    False
4    False
5    False
Name: CAR ID, dtype: bool

In [70]:
newdf=df['CAR ID']<40

In [71]:
df[newdf]

   CAR ID CAR NAME
0      10      bmw
1      20       rr
2      30    volvo

In [72]:
df[newdf]['CAR NAME']

0      bmw
1       rr
2    volvo
Name: CAR NAME, dtype: object

In [83]:
df

   CAR ID CAR NAME
0      10      bmw
1      20       rr
2      30    volvo
3      40     thar
4      50     ford
5      60     None

In [85]:
#multiple conditions
df[(df['CAR NAME']=='volvo')&(df['CAR ID']>20)]

   CAR ID CAR NAME
2      30    volvo

In [87]:
#adding new column
s='jithu,ismail,rajesh'.split(',')
print(s)
print(type(s))

['jithu', 'ismail', 'rajesh']
<class 'list'>

In [91]:
d={'USN':[100,101,102],
   'NAME':['jerry','tom','ramesh'],
   'MOBILE':[99,98,77],
   'MARKS':[30,35,None]
  }

In [92]:
std=pd.DataFrame(d)

In [93]:
std

   USN    NAME  MOBILE  MARKS
0  100   jerry      99   30.0
1  101     tom      98   35.0
2  102  ramesh      77    NaN

In [95]:
std.dropna()

   USN   NAME  MOBILE  MARKS
0  100  jerry      99   30.0
1  101    tom      98   35.0

In [98]:
std.dropna(thresh=2)

   USN    NAME  MOBILE  MARKS
0  100   jerry      99   30.0
1  101     tom      98   35.0
2  102  ramesh      77    NaN